function [ich1,qch1]=ofdmmap(ich,qch,fftlen,nd)

ich1=zeros(fftlen,nd);
qch1=zeros(fftlen,nd);

ich1(3:11,:)=ich(55:63,:);
ich1(13:25,:)=ich(64:76,:);
ich1(27:53,:)=ich(77:103,:);
ich1(55:59,:)=ich(104:108,:);
ich1(71:75,:)=ich(1:5,:);
ich1(77:103,:)=ich(6:32,:);
ich1(105:117,:)=ich(33:45,:);
ich1(119:127,:)=ich(46:54,:);

qch1(3:11,:)=qch(55:63,:);
qch1(13:25,:)=qch(64:76,:);
qch1(27:53,:)=qch(77:103,:);
qch1(55:59,:)=qch(104:108,:);
qch1(71:75,:)=qch(1:5,:);
qch1(77:103,:)=qch(6:32,:);
qch1(105:117,:)=qch(33:45,:);
qch1(119:127,:)=qch(46:54,:);

% 虽然导频也是空的，但似乎1，2，128与中间的60-70是空子载波的范畴，其他是导频。
% 频谱两侧预留空子载波，抑制带外辐射，减少相邻信道干扰，方便后端滤波处理。
% 中心直流子载波空置，避免本振泄露、直流偏差造成基带信号失真。
% N 点 IFFT/FFT 频谱中，正中间序号对应的频率为 0Hz，对应电学里直流 0 频分量，因此得名直流子载波。